app/views/devise/registrations/edit.html.erb

SELECT "companies".* FROM "companies"
---
  <% if current_user.role == "realtor" %>
    <%= f.select :company_id, Company.all.map{|c| [c.name,c.id]}, :prompt => "Select a company" %>