app/controllers/enquiries_controller.rb

  def index
    if current_user.role == "realtor"
      @search = EnquirySearch.new(current_user.company_id)
      #@search = ListingSearch.new(params[:search])
      @enquiries = @search.scope
    else
      @enquiries = Enquiry.all
---
SELECT  "enquiries".* FROM "enquiries" WHERE (listing_id LIKE 4) ORDER BY "enquiries"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def new
    @enquiry = current_user.enquiries.build
    @listings = Listing.all.map{|l| [l.current_house_owner,l.id]}
---
SELECT "listings".* FROM "listings"

  def create
    @enquiry =current_user.enquiries.build(enquiry_params)
    @enquiry.listing_id = params[:listing_id]
    respond_to do |format|
      if @enquiry.save
---
INSERT INTO "enquiries" ("subject", "message_content", "created_at", "updated_at", "user_id", "listing_id") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "abcd"], ["message_content", "abcdef"], ["created_at", "2018-10-10 22:37:07.607194"], ["updated_at", "2018-10-10 22:37:07.607194"], ["user_id", 6], ["listing_id", 9]]

    def set_enquiry
      @enquiry = Enquiry.find(params[:id])
---
SELECT  "enquiries".* FROM "enquiries" WHERE "enquiries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]