app/controllers/listings_controller.rb

SELECT "companies".* FROM "companies"
---
  def edit

    @companies = Company.all.map do |c|

INSERT INTO "listings" ("location", "square_footage", "year_built", "style", "list_price", "floors", "basement", "current_house_owner", "contact", "created_at", "updated_at", "user_id", "company_id", "listing_img_file_name", "listing_img_content_type", "listing_img_file_size", "listing_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @listing = current_user.listings.build(listing_params)
    @listing.company_id = params[:company_id]
    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "listing_img_file_name" = ?, "listing_img_content_type" = ?, "listing_img_file_size" = ?, "listing_img_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = ?
---
  def update
    @listing.company_id = params[:company_id]
    respond_to do |format|
      if @listing.update(listing_params)