app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE (list_price BETWEEN 0 AND 1000 AND square_footage BETWEEN 0 AND 100000 AND location LIKE 'raleigh\' )
---
  def index
    @listings = Listing.all

SELECT "companies".* FROM "companies"
---
  def new
    @listing = current_user.listings.build
    @companies = Company.all.map{|c| [c.name, c.id]}

INSERT INTO "listings" ("location", "square_footage", "year_built", "style", "list_price", "floors", "basement", "current_house_owner", "contact", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @listing = current_user.listings.build(listing_params)

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "company_id" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["company_id", 2], ["updated_at", "2018-09-30 01:56:39.150299"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)