app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Ojas Barve"], ["phone", 9192475355], ["updated_at", "2018-09-29 00:34:48.333381"], ["id", 1]]
---
  def update
    @user.company_id = params[:company_id]
    respond_to do |format|
      if @user.update(user_params)